app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    @artist = Artist.find_by_id(params[:id])